_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 50, 48, 48)        500       
_________________________________________________________________
activation_1 (Activation)    (None, 50, 48, 48)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 50, 46, 46)        22550     
_________________________________________________________________
activation_2 (Activation)    (None, 50, 46, 46)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 50, 23, 23)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 50, 23, 23)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 26450)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               3385728   
_________________________________________________________________
activation_3 (Activation)    (None, 128)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 9)                 1161      
_________________________________________________________________
activation_4 (Activation)    (None, 9)                 0         
=================================================================
Total params: 3,409,939
Trainable params: 3,409,939
Non-trainable params: 0
_________________________________________________________________
None